In [1]:
import pandas as pd
import numpy as np

In [2]:
dictionary1 = {"name":["Ahmet","Mehmet","Atil"],"Sport":["Running","Swimming","Fotball"],"Calories":[300,350,500]}
dF1 = pd.DataFrame( dictionary1)
dF1

     name     Sport  Calories
0   Ahmet   Running       300
1  Mehmet  Swimming       350
2    Atil   Fotball       500

In [3]:
dictionary2 = {"name":["Ali","Veli","Ferit"],"Sport":["Running","Swimming","Football"],"Calories":[370,542,503]}
dF2 = pd.DataFrame( dictionary2,index=[3,4,5])
dF2

    name     Sport  Calories
3    Ali   Running       370
4   Veli  Swimming       542
5  Ferit  Football       503

## Concatenation

In [4]:
pd.concat([dF1,dF2],axis=0)

     name     Sport  Calories
0   Ahmet   Running       300
1  Mehmet  Swimming       350
2    Atil   Fotball       500
3     Ali   Running       370
4    Veli  Swimming       542
5   Ferit  Football       503

## Merge

In [5]:
dictionary3 = {"name":["Ahmet","Mehmet","Atil"],"Sport":["Running","Swimming","Fotball"]}
dF3 = pd.DataFrame( dictionary3)
dictionary4 = {"name":["Ahmet","Mehmet","Atil"],"Calories":[370,542,503]}
dF4 = pd.DataFrame( dictionary4,index=[3,4,5])

In [6]:
pd.merge(dF3,dF4,on="name")

     name     Sport  Calories
0   Ahmet   Running       370
1  Mehmet  Swimming       542
2    Atil   Fotball       503

In [7]:
employeeDict = {"Name":["Hasan","Ali","Serdar","Salih"],"Departman":["Software","Sales","Marketing","Software"],"Salary":[200,300,400,500]}
employeeDF = pd.DataFrame(employeeDict)
employeeDF

     Name  Departman  Salary
0   Hasan   Software     200
1     Ali      Sales     300
2  Serdar  Marketing     400
3   Salih   Software     500

In [8]:
employeeDF["Departman"].unique()

array(['Software', 'Sales', 'Marketing'], dtype=object)

In [9]:
employeeDF["Departman"].nunique()

3

In [10]:
employeeDF["Departman"].value_counts()

Software     2
Sales        1
Marketing    1
Name: Departman, dtype: int64

In [11]:
def brutToNet(salary):
    return salary*0.6

In [12]:
employeeDF["Salary"].apply(brutToNet)

0    120.0
1    180.0
2    240.0
3    300.0
Name: Salary, dtype: float64